Revit 2016 API
GlobalParameter.IsReporting Property
 Indicates whether this is a reporting global parameter or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public bool IsReporting { get; set; }
Visual Basic
Public Property IsReporting As Boolean
	Get
	Set
Visual C++
public:
property bool IsReporting {
	bool get ();
	void set (bool value);
}
Field Value
 True if the parameter is reporting, False otherwise.
Remarks
When a global parameter is declared as reporting, it takes its value from the one driving dimension it is set to label. To be declared as reporting, a parameter must be labeling exactly one dimension only. If a global parameter is not labeling any dimensions at the time it is declared as reporting, its its value stays unchanged until a driving dimension is labeled with it.
Reporting parameters can be (currently) only of type Length or Angle, but programmers can always call the HasValidTypeForReporting() first when in doubt about whether a global parameter has a data type eligible for reporting.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The global parameter is not of a type that may be used with reporting. Generally, a reporting parameter must be either of type Length or Angle. -or- When setting this property: The reporting status of the global parameter may not be presently changed! Reasons for that include cases of currently non-reporting parameters that are already driven by a formula, or label multiple dimensions, or are of a type that does not support reporting. On the other hand, currently reporting parameters may not be changed if they are driven by a locked dimension or an arc-length dimension, for those are not allowed to have their value determined by the value of a global parameter.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This is a formula-driven parameter. As such it does not allow the current operation. -or- When setting this property: This non-reporting global parameter has already labeled other dimensions (more then 1). It cannot, therefore, be made reporting and dimension-driven before un-labeling all the dependent dimensions first.
See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace